tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/constant/transportProperties1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] Visc;

kf kf [0 -2 0 0 0 0 0] k_f;

momentumSource momentumSourtce [0 1 -2 0 0 0 0] (0 0 0);




// ************************************************************************* //
