tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-15;
        relTol           0.1;
        nSweeps          1;
    }

    T 
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.1;
    }
}

SIMPLE
{
    nS 1;
    cS 0.1;

    nNonOrthogonalCorrectors 0;


        residualControl
        {
                p               1e-7;
                U               1e-7;
                T               1e-9;
        }

}

relaxationFactors
{
    p               0.7;
    U               0.3;
    T            0.7;
}

cache
{
    grad(U);
    grad(p);
}


// ************************************************************************* //
