tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/cellSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}

name refinementRegion;
action new;
topoSetSources
(
fieldToCell
{
fieldName eps;
min 0.001;
max 0.999;
}
);