tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .001000;

y1 0;
y2 .001000;

z1 0;
z2 .001000;

velocity volumeAveraged;
pressureDrop velocityWeightedAverageGradient;
